#+TITLE: Unidata Technology with Python (in construction for 2015)
#+DATE: <2015-07-06 Mon>
#+AUTHOR: Unidata Python Development Team
#+EMAIL: support-python@unidata.ucar.edu
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: creator:comment d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:nil p:nil pri:nil stat:t tags:t tasks:t tex:t timestamp:t toc:t
#+OPTIONS: todo:t |:t
#+CREATOR: Emacs 24.5.1 (Org mode 8.2.10)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport



#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export

- *What*: Jupyter notebooks and related material on exploring Unidata technology
  with Python for the 2015 Unidata Training Workshop.
- *When*: <2015-07-20 Mon>--<2015-07-23 Wed>
- *Where*: [[http://www.unidata.ucar.edu/about/#visit][UCAR Foothills Lab 4, Room 1201]]

** Workshop Schedule for <2015-07-20 Mon>

|----+-------------------------------------------------+-------------------+-------------+--------+----------|
|    | Section                                         | IPyNB or Markdown | Presenter   | Length |     Time |
|----+-------------------------------------------------+-------------------+-------------+--------+----------|
|  1 | Continental breakfast                           |                   |             |   0:30 | 08:30:00 |
|  2 | [[http://figshare.com/s/613753ea58ae11e4a40206ec4b8d1f61][Introductions and overview]]                      |                   | Ethan       |   0:20 | 09:00:00 |
|  3 | Software carpentry for science w/ git/github    |                   | Julien/Ryan |   1:45 | 09:20:00 |
|  4 | Break                                           |                   |             |   0:20 | 11:05:00 |
|  5 | Software carpentry for science w/ conda/binstar |                   | Julien      |   1:00 | 11:25:00 |
|  6 | Lunch on your own                               |                   |             |   1:15 | 12:25:00 |
|  7 | [[http://nbviewer.ipython.org/urls/raw.github.com/Unidata/unidata-python-workshop/master/ipython-notebook-examples][IPython notebook introduction]]                   | ipython-notebook  | Ward        |   1:00 | 13:40:00 |
|  8 | [[http://nbviewer.ipython.org/github/Unidata/unidata-python-workshop/blob/master/numpy.ipynb][Numpy with intro to matplotlib Part 1]]           | numpy             | Ryan        |   1:00 | 14:40:00 |
|  9 | Break                                           |                   |             |   0:20 | 15:40:00 |
| 10 | [[http://nbviewer.ipython.org/github/Unidata/unidata-python-workshop/blob/master/numpy.ipynb][Numpy with intro to matplotlib Part 2]]           | numpy             | Ryan        |   1:00 | 16:00:00 |
| 11 | End of day 1                                    |                   |             |        | 17:00:00 |
|----+-------------------------------------------------+-------------------+-------------+--------+----------|
#+TBLFM: @3$6..@-1$6=@-1$5+@-1$6;T::$1=@#-1

** Workshop Schedule for <2015-07-21 Tue>

|----+--------------------------------------+-------------------+-----------+--------+----------|
|    | Section                              | IPyNB or Markdown | Presenter | Length |     Time |
|----+--------------------------------------+-------------------+-----------+--------+----------|
|  1 | Continental breakfast                |                   |           |   0:30 | 08:30:00 |
|  2 | [[http://figshare.com/s/c187717c58ad11e48fe806ec4b8d1f61][Introduction to netCDF]]               | intro_netCDF      | Russ/Ward |   1:00 | 09:00:00 |
|  3 | Break                                |                   |           |   0:15 | 10:00:00 |
|  4 | [[http://nbviewer.ipython.org/urls/raw.github.com/Unidata/unidata-python-workshop/master/reading_netCDF.ipynb][Reading netCDF]]                       | reading_netCDF    | Jeff W.   |   1:00 | 10:15:00 |
|  5 | [[http://nbviewer.ipython.org/urls/raw.github.com/Unidata/unidata-python-workshop/master/writing_netCDF.ipynb][Writing netCDF]]                       | writing_netCDF    | Jeff W.   |   1:00 | 11:15:00 |
|  6 | Lunch on your own                    |                   |           |   1:00 | 12:15:00 |
|  7 | [[http://nbviewer.ipython.org/urls/raw.github.com/Unidata/unidata-python-workshop/master/matplotlib.ipynb][Geoscience vis w/ matplotlib/cartopy]] | matplotlib        | Ryan      |   1:30 | 13:15:00 |
|  8 | Break                                |                   |           |   0:15 | 14:45:00 |
|  9 | [[http://nbviewer.ipython.org/urls/raw.github.com/Unidata/unidata-python-workshop/master/casestudy.ipynb][NetCDF case study]]                    |                   | Julien    |   1:00 | 15:00:00 |
| 10 | End of day 2                         |                   |           |        | 16:00:00 |
|----+--------------------------------------+-------------------+-----------+--------+----------|
#+TBLFM: @3$6..@-1$6=@-1$5+@-1$6;T::$1=@#-1

** Workshop Schedule for <2015-07-22 Wed>

|----+-----------------------------------------------+-------------------+-----------+--------+----------|
|    | Section                                       | IPyNB or Markdown | Presenter | Length |     Time |
|----+-----------------------------------------------+-------------------+-----------+--------+----------|
|  1 | Continental breakfast                         |                   |           |   0:30 | 08:30:00 |
|  2 | Pythonic Section (à la Johnny Lin)            |                   | Ryan      |   1:00 | 09:00:00 |
|  3 | Siphon                                        |                   | Josh      |   1:00 | 10:00:00 |
|  4 | Break                                         |                   |           |   0:15 | 11:00:00 |
|  5 | MetPy (including ported GEMPAK stuff)         |                   | Ryan      |   1:00 | 11:15:00 |
|  6 | Lunch on your own                             |                   |           |   1:00 | 12:15:00 |
|  7 | [[http://nbviewer.ipython.org/urls/raw.github.com/Unidata/unidata-python-workshop/master/Geocoded_METAR.ipynb][Point observations w/ TDS]]                     | ncss              | Sean      |   1:00 | 13:15:00 |
|  8 | [[http://nbviewer.ipython.org/urls/raw.github.com/Unidata/unidata-python-workshop/master/wms_sample.ipynb][Exploring WMS]] (w/ ncWMS & Cartopy extensions) | wms_sample        | Sean      |   1:00 | 14:15:00 |
|  9 | Break                                         |                   |           |   0:15 | 15:15:00 |
| 10 | [[http://nbviewer.ipython.org/urls/raw.github.com/Unidata/unidata-python-workshop/master/CompositeRadar.ipynb][Accessing radar composites]]                    | CompositeRadar    | Ryan      |   1:00 | 15:30:00 |
| 11 | End of day 3                                  |                   |           |        | 16:30:00 |
|----+-----------------------------------------------+-------------------+-----------+--------+----------|
#+TBLFM: @3$6..@-1$6=@-1$5+@-1$6;T::$1=@#-1

** Installation Instructions

For this workshop, we will be using the following Python libraries:

- [[http://www.numpy.org/][numpy]]
- [[https://github.com/Unidata/netcdf4-python][netcdf4-python]]
- [[http://matplotlib.org/][matplotlib]]
- [[http://scitools.org.uk/cartopy/][cartopy]]
- [[https://pypi.python.org/pypi/OWSLib/][OWSLib]]
- [[https://github.com/Unidata/siphon][siphon]]
- [[https://github.com/metpy/MetPy][MetPy]]
- [[https://github.com/xray/xray][xray]]


The easiest way to install these libraries is with [[http://conda.pydata.org/][conda]].

1. [[http://conda.pydata.org/miniconda.html][Install Miniconda (Python 3.4) from Continuum Analytics]].
  ([[http://www.akaipro.com/kb/article/1616#os_32_or_64_bit][Determine if your OS 32 or 64 bit]])
2. Once Miniconda is installed, from the command line (e.g., OS X terminal,
  cmd.exe), run these instructions:

#+BEGIN_SRC shell
conda config --add channels http://conda.binstar.org/unidata

conda create -n workshop2015 python=3 ipython numpy netcdf4 matplotlib cartopy
  OWSLib siphon MetPy xray pyzmq jinja2 tornado jsonschema networkx

#+END_SRC

*** From a Unix command line (e.g., OS X terminal)
If your default shell is NOT bash, first type =bash=.
To activate or switch to a conda environment, you can =source activate
<environment>=. For example,

#+BEGIN_SRC shell
source activate workshop2015
#+END_SRC

To switch and/or deactivate environments:

#+BEGIN_SRC shell
source deactivate
source activate <environment>
#+END_SRC

*** From a Windows command line (e.g., cmd.exe)

To activate or switch to a conda environment, you can =activate
<environment>=. For example,

#+BEGIN_SRC shell
activate workshop2015
#+END_SRC

To switch and/or deactivate environments:

#+BEGIN_SRC shell
deactivate
activate <environment>
#+END_SRC

** Running the notebooks

#+BEGIN_SRC shell
git clone https://github.com/Unidata/unidata-python-workshop

cd unidata-python-workshop

# unix, use bash. windows omit 'source'
source activate workshop2015

ipython notebook
#+END_SRC

** Please give us your feedback

From the Unidata [[http://www.unidata.ucar.edu/][page]], go to the "2015 Training Workshop" [[http://www.unidata.ucar.edu/events/2014TrainingWorkshop/][page]] by selecting
"Events" -> "2015 Training Workshop" from the menu. Click on the "Give us your
Feedback" link to get to the [[http://www.unidata.ucar.edu/community/surveys/2014training/survey.html][survey]].

Note: Please feel free to use the survey at any time during the class (and as
often as you like) as comments come to mind.
